fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ЗапланированныеОтпуска</registerRecords>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазностьДат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ОпределитьЧислоДнейОтпуска()
	
	Для Каждого СтрокаТч из Объект.ОтпускаСотрудников Цикл 
		РазностьДат = (СтрокаТч.ДатаОкончания - СтрокаТч.ДатаНачала) / 86400;
		СтрокаТч.РазностьДат = РазностьДат;
	КонецЦикла; 
 
КонецПроцедуры 


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОпределитьЧислоДнейОтпуска();
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОпределитьЧислоДнейОтпуска();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ОпределитьЧислоДнейОтпуска();
КонецПроцедуры


&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	ОпределитьЧислоДнейОтпуска();
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеТч()
	
	ТекущиеДанные = Объект.ОтпускаСотрудников.Выгрузить();
	АдресДанных = ПоместитьВоВременноеХранилище(ТекущиеДанные);
	
	Возврат АдресДанных;
КонецФункции

&НаКлиенте
Процедура АнализГрафика(Команда)
	ТекущиеДанные = ПолучитьДанныеТч();
	ПараметрыДляПередачи = Новый Структура ("АдресДанных",ТекущиеДанные);
	ПараметрыДляПередачи.Вставить("МесяцПериода", НачалоМесяца(Объект.Дата));
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыДляПередачи);
КонецПроцедуры
